tap 'buo/cask-upgrade'
tap 'caskroom/cask'

tap 'homebrew/core'
tap 'homebrew/bundle'

brew 'mas'

# Basic Softwares 
## Notes
mas 'Bear', id: 1091189122

## Screen Shot
mas 'Lightshot Screenshot', id: 526298438

## IMs
mas 'LINE', id: 539883307
cask 'telegram'
cask 'slack'
cask 'mattermost'
cask 'teamviewer'

## Video Players
cask 'vlc'

## Password Manager
cask '1password'

## Spotlight
cask 'alfred'

## APP Cleaner
cask 'appcleaner'

## Unarchiver
cask 'the-unarchiver'

## Currency Converter
cask 'numi'

## Browsers
cask 'caskroom/versions/firefox-developer-edition'
cask 'caskroom/versions/google-chrome-dev'

## Markdown Editor
cask 'macdown'
cask 'typora'

## Mind Mapping
cask 'xmind'

## Music
cask 'spotify'

## Cloud Drive
cask 'google-backup-and-sync'

## Screen Saver
cask 'aerial'


# Design Tools
cask 'sketch'
cask 'zeplin'


# Development Tools
## Terminal Tool
brew 'tree'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

## Git
brew 'git'

## Languages
brew 'vim'
brew 'python3'
brew 'node'

## Package Manager
brew 'yarn', args: ["without-node"]

## Terminals
cask 'iterm2'

## Git Tools
cask 'sourcetree'
cask 'gitkraken'

## Editor
cask 'visual-studio-code'

## Database Client
cask 'sequel-pro'

## Docker
cask 'docker'
cask 'docker-toolbox'