tap "buo/cask-upgrade"
tap "caskroom/cask"
tap "caskroom/fonts"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "git"
brew "git-flow-avh"
brew "mas"
brew "node"
brew "openssl@1.1"
brew "python@3.9", link: false
brew "tree"
brew "vim"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "1password"
cask "app-cleaner"
cask "font-fira-code"
cask "google-backup-and-sync"
cask "google-chrome"
cask "homebrew/cask-versions/firefox-developer-edition"
cask "iterm2"
cask "postman"
cask "skype"
cask "spotify"
cask "sourcetree"
cask "telegram"
cask "visual-studio-code"
cask "zeplin"
mas "Bear", id: 1091189122
mas "Lightshot Screenshot", id: 526298438
mas "LINE", id: 539883307
